test_playbook/expects/book_5_role.puml
@startuml
state "= Play: Test 5 role" as play_1 {
    play_1 : | hosts | localhost |
    state "== pre" as task_1
    task_1 : Action **debug**
    task_1 : | msg | pre |
    state "== role_1 : Role Start" as task_2
    task_2 : Action **debug**
    task_2 : | msg | Start role_1 |
    state "== role_1 : Role End" as task_3
    task_3 : Action **debug**
    task_3 : | msg | End role_1 |
    state "== post" as task_4
    task_4 : Action **debug**
    task_4 : | msg | post |
}
[*] --> task_1
task_1 --> task_2
task_2 --> task_3
task_3 --> task_4
task_4 --> [*]
@enduml
